//*****************************************************************************
// File: Observer.cpp
//
// Desc: implementation of the CObserver, CSubject class.
//
// producer: Ahn Sang-Kyu
//*****************************************************************************

#include "stdafx.h"
#include "Observer.h"

//*****************************************************************************
// CObserver
//*****************************************************************************

//////////////////////////////////////////////////////////////////////
// Construction/Destruction
//////////////////////////////////////////////////////////////////////

CObserver::CObserver()
{

}

CObserver::~CObserver()
{

}


//*****************************************************************************
// CSubject
//*****************************************************************************

//////////////////////////////////////////////////////////////////////
// Construction/Destruction
//////////////////////////////////////////////////////////////////////

CSubject::CSubject()
{

}

CSubject::~CSubject()
{

}

//*****************************************************************************
// ÇÔ¼ö ÀÌ¸§ : Attach()
// ÇÔ¼ö ¼³¸í : ¿ÉÁ®¹ö ¸®½ºÆ®¿¡ Ãß°¡.
//			   (¼­ºêÁ§Æ® ÀÚ½Ä Å¬·¡½º »ý¼º½Ã È£ÃâÇÏ´Â °ÍÀÌ Àû´ç.)
// ¸Å°³ º¯¼ö : pObserver	: ¿ÉÁ®¹ö ¿ÀºêÁ§Æ®ÀÇ Æ÷ÀÎÅÍ.
//*****************************************************************************
void CSubject::Attach(CObserver* pObserver)
{
	m_ObserverList.AddTail(pObserver);
}

//*****************************************************************************
// ÇÔ¼ö ÀÌ¸§ : Attach()
// ÇÔ¼ö ¼³¸í : ¿ÉÁ®¹ö ¸®½ºÆ®¿¡¼­ »èÁ¦.
//			   (¼­ºêÁ§Æ® ÀÚ½Ä Å¬·¡½º ¸±¸®Áî Àü¿¡ È£ÃâÇÏ´Â °ÍÀÌ Àû´ç.)
// ¸Å°³ º¯¼ö : pObserver	: ¿ÉÁ®¹ö ¿ÀºêÁ§Æ®ÀÇ Æ÷ÀÎÅÍ.
//*****************************************************************************
void CSubject::Detach(CObserver* pObserver)
{
	NODE* pPos = m_ObserverList.Find(pObserver);
	if (pPos)
		m_ObserverList.RemoveAt(pPos);
}

//*****************************************************************************
// ÇÔ¼ö ÀÌ¸§ : Notify()
// ÇÔ¼ö ¼³¸í : ¸®½ºÆ®¸¦ ¼øÈ¸ÇÏ¸ç ¿ÉÀú¹öÀÇ UpdateData(this)È£Ãâ.
//			   (¼­ºêÁ§Æ® ³»¿ë º¯È­°¡ ÀÖÀ» ¶§ È£ÃâÇÏ¸é µÊ.)
//*****************************************************************************
void CSubject::Notify()
{
	CObserver* pObserver;
	NODE* pPos = m_ObserverList.GetHeadPosition();
	while (pPos)
	{
		pObserver = (CObserver*)m_ObserverList.GetNext(pPos);
		pObserver->UpdateData(this);
	}
}